ERP.belugaerp/src/Documents/ПроизводствоБезЗаказа/ПроизводствоБезЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПроизводствоБезЗаказа</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямПродукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/бг_ПроизводствоБезЗаказаИнтеграция/Module.bsl
#Область ПрограммныИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
	
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный, адаптер_РаботаСДаннымиИБ;
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ДанныеОбъекта = адаптер_ОбработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	Если ДанныеОбъекта <> Неопределено 
		И ДанныеОбъекта.Реквизиты.Количество() > 0 Тогда
		
		Организация       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Организация");
		ОрганизацияСклада = ОрганизацияСклада(Объект);
		
		РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
		
		РеквизитыОбъекта.Вставить("ВыпускВЛабораторию", Организация = Справочники.Организации.УправленческаяОрганизация);
		Если РеквизитыОбъекта.Свойство("Организация")
			И ОрганизацияСклада <> Неопределено Тогда
			РеквизитыОбъекта.Организация.Идентификатор = адаптер_РаботаСДаннымиИБ.ПолучитьУникальныйИдентификатор(ОрганизацияСклада);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Реквизиты шапки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"ВыпускВЛабораторию",
		Новый ОписаниеТипов("Булево"));
	
КонецПроцедуры

Функция ОрганизацияСклада(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	ВЫРАЗИТЬ(ПроизводствоБезЗаказаВыходныеИзделия.Получатель КАК Справочник.Склады).бг_Организация КАК Организация
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	|ГДЕ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1
		И Выборка.Следующий()
		И ЗначениеЗаполнено(Выборка.Организация) Тогда
		Возврат Выборка.Организация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Реквизиты шапки
	ВыгружаемыеРеквизиты.Добавить("Дата");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("Проведен");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Организация");
	ВыгружаемыеРеквизиты.Добавить("ГруппировкаЗатрат");
	ВыгружаемыеРеквизиты.Добавить("Подразделение");
	ВыгружаемыеРеквизиты.Добавить("Комментарий");
	
	// Реквизиты ТЧ "ВыходныеИзделия"
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.НомерГруппыЗатрат");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.Количество");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.Спецификация");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.Серия");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.Получатель");
	ВыгружаемыеРеквизиты.Добавить("ВыходныеИзделия.ДоляСтоимости");
	
	// Реквизиты ТЧ "МатериалыИРаботы"
	ВыгружаемыеРеквизиты.Добавить("МатериалыИРаботы.НомерГруппыЗатрат");
	ВыгружаемыеРеквизиты.Добавить("МатериалыИРаботы.Номенклатура");
	ВыгружаемыеРеквизиты.Добавить("МатериалыИРаботы.Характеристика");
	ВыгружаемыеРеквизиты.Добавить("МатериалыИРаботы.Серия");
	ВыгружаемыеРеквизиты.Добавить("МатериалыИРаботы.Количество");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;

КонецФункции

#КонецОбласти
